import re
print("Лаштабєг Ася Володимирівна\nЛабораторна робота №1 \nВаріант 16\nЗнаходження точки на графіку функції")
def read (q):
	x = input(q)
	while not re.match(r'(?:[0]\.\d+)|(?:[1-9]\d*(?:\.\d+)?)', x):
		x = input(q)
	return float(x)
	
def main ():
	t = read("Введіть першу координату")
	n = read("Введіть другу координату")
	a = read("Введіть перший коефіцієнт")
	b = read("Введіть другий коефіцієнт")
	c = read("Введіть трєтій коефіцієнт")
	print("Координати даної точки: ({};{})" .format(t, n))
	print("Задана функція: y={}*x^2+{}*x + {}" .format(a, b, c))
	x = t
	y = a*x*x+b*x+c
	if ( y == n ) : print("Графік функції проходить через точку")
	else : print("Графік функції не проходить через задану точку")
	
main ()