import re
print("Лаштабєг Ася Володимирівна\nЛабораторна робота №1 \nВаріант 16\nСпіввідношення довжин року на планетах")
def read (q):
	x = input(q)
	while not re.match(r'(?:[0]\.\d+)|(?:[1-9]\d*(?:\.\d+)?)', x):
		x = input(q)
	return float(x)
	
def main ():
	r1=read("Введіть радіус першої орбіти")
	v1=read("Введіть швидкість руху першої орбіти")
	r2=read("Введіть радіус другої планети")
	v2=read("Введіть швидкість руху другої орбіти")
	print("Радіус першої орбіти: " +str(r1))
	print("Швидкість руху першої орбіти: " +str(v1))
	print("Радіус другої планети: " +str(r2))
	print("Швидкість руху другої орбіти: " +str(v2))
	t1=2*r1*3.14/v1
	t2=2*r2*3.14/v2
	print("Час обертання першої планети: " +str(t1))
	print("Час обертання другої планети: " +str(t2))
	if(t1>t2):t='так'
	else:t='ні'
	print("Чи довше час обертання на перщій планеті ніж на другій? - " +str(t))
	
main()